In [ ]:
!pip install mysql-connector

In [ ]:
import mysql.connector
#importing database
database = mysql.connector.connect(
host="localhost",
user="root",
password=""
)
db = database.cursor()

db.execute("CREATE DATABASE pythons1")

In [2]:
import mysql.connector
#importing database
database = mysql.connector.connect(
host="localhost",
user="root",
password="",
database = "python3pm")
db = database.cursor()

In [3]:
sql = "SELECT * FROM student"
db.execute(sql)
result =db.fetchall()
print(result)

[(1, 'Rama', 89, 98, 85, 67, 89, 428, 85.6, 'A'), (3, 'Nabin', 89, 82, 84, 98, 89, 445, 89.6, 'A'), (4, 'Shiva', 49, 57, 25, 98, 89, 318, 63.6, 'C'), (8, 'Ram', 78, 79, 93, 67, 78, 415, 83.5, 'A'), (10, 'Sameer', 89, 67, 80, 98, 89, 412, 82.5, 'A')]

In [4]:
sql = "SELECT * FROM student"
db.execute(sql)
result =db.fetchall()
for i in result:
    print(i)

(1, 'Rama', 89, 98, 85, 67, 89, 428, 85.6, 'A')
(3, 'Nabin', 89, 82, 84, 98, 89, 445, 89.6, 'A')
(4, 'Shiva', 49, 57, 25, 98, 89, 318, 63.6, 'C')
(8, 'Ram', 78, 79, 93, 67, 78, 415, 83.5, 'A')
(10, 'Sameer', 89, 67, 80, 98, 89, 412, 82.5, 'A')

In [5]:
sql = "SELECT * FROM student WHERE per > 70"
db.execute(sql)
result =db.fetchall()
for i in result:
    print(i)

(1, 'Rama', 89, 98, 85, 67, 89, 428, 85.6, 'A')
(3, 'Nabin', 89, 82, 84, 98, 89, 445, 89.6, 'A')
(8, 'Ram', 78, 79, 93, 67, 78, 415, 83.5, 'A')
(10, 'Sameer', 89, 67, 80, 98, 89, 412, 82.5, 'A')

In [6]:
sql = "SELECT name,grade FROM student WHERE per > 70"
db.execute(sql)
result =db.fetchall()
for i in result:
    print(i)

('Rama', 'A')
('Nabin', 'A')
('Ram', 'A')
('Sameer', 'A')

In [7]:
sql = "SELECT name,grade FROM student WHERE per > 70"
db.execute(sql)
result =db.fetchall()
for i in result:
    print(i)

('Rama', 'A')
('Nabin', 'A')
('Ram', 'A')
('Sameer', 'A')

In [ ]:
sql = '''INSERT INTO student(sn, name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES (8,'Ram',78,79,93,67,78,415,83.5,'A')'''
db.execute(sql)
database.commit()

In [19]:
name = input("Enter name = ")
physics = int(input("Enter physics = "))
chemistry = int(input("Enter chemistry = "))
math = int(input("Enter math = "))
english = int(input("Enter english = "))
nepali = int(input("Enter nepali = "))

total = physics+chemistry+math+english+nepali
per = total/5 
if per >= 80:
    grade = "A"
elif per >= 60:
    grade = "B"
elif per >= 45:
    grade = "C"
else:
    grade = "F"
    
sql = f'''INSERT INTO student(name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}')'''
db.execute(sql)
database.commit()

Enter name = Rama
Enter physics = 89
Enter chemistry = 78
Enter math = 67
Enter english = 81
Enter nepali = 87